app/controllers/api/v1/articulos_controller.rb

            def index
                articulos = Articulo.order('created_at DESC')
---
SELECT "articulos".* FROM "articulos" ORDER BY created_at DESC

            def show
                articulos = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

            def create
                articulo = Articulo.new(articulo_params)
                if articulo.save
---
INSERT INTO "articulos" ("titulo", "cuerpo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titulo", "Primera carga desde Posmant"], ["cuerpo", "Este Articulo"], ["created_at", "2018-09-19 01:06:22.382788"], ["updated_at", "2018-09-19 01:06:22.382788"]]

            def update
                articulo = Articulo.find(params[:id])
                if articulo.update_attributes(articulo_params)
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "articulos" SET "titulo" = $1, "cuerpo" = $2, "updated_at" = $3 WHERE "articulos"."id" = $4  [["titulo", "El update"], ["cuerpo", "loremmmssssdsdsdsd"], ["updated_at", "2018-09-19 01:46:44.916254"], ["id", 3]]

            def destroy
                articulo = Articulo.find(params[:id])
                articulo.destroy
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "articulos" WHERE "articulos"."id" = $1  [["id", 3]]